pmo-dataset/mermaid/44.mmd
graph LR
	classDef endEvent stroke-width:4px
	
	StartNoneEvent_1(("Food order decided")) --> User_1["Select type of order"]
	User_1 --> ExclusiveGateway_1{"Menu or just the\nburger ?"}
	User_3["Select type of\nbeverage"] --> ParallelGateway_1{"+"}
	ParallelGateway_1 --> Service_1["Prepare beverage"]
	ParallelGateway_1 --> User_4["Select side"]
	Service_1 --> ParallelGateway_2{"+"}
	User_4 --> ParallelGateway_2
	Service_2["Prepare potato\nwedges"] --> ExclusiveGateway_3{"X"}
	Service_3["Prepare French fries"] --> ExclusiveGateway_3
	ExclusiveGateway_2{"Fries or wedges ?"} -->|"Potato wedges"| Service_2
	ExclusiveGateway_2 -->|"French fries"| Service_3
	ParallelGateway_2 --> ExclusiveGateway_2
	User_5["Select menu"] --> User_3
	User_2["Select burger"] --> ExclusiveGateway_4{"X"}
	ExclusiveGateway_1 -->|"With menu"| User_5
	ExclusiveGateway_3 --> ExclusiveGateway_4
	ParallelGateway_3{"+"} --> ExclusiveGateway_5{"X"}
	IntermediateTimerEvent_1(("30 seconds")) --> Service_5["Check status"]
	Service_5 --> ExclusiveGateway_6{"Is burger ready ?"}
	Service_4["Prepare burger"] --> ParallelGateway_4{"+"}
	Service_7["Deliver via conveyor\nbelt"] --> EndNoneEvent_1(("Food delivered")):::endEvent
	ExclusiveGateway_5 --> Service_6["Update status"]
	Service_6 --> IntermediateTimerEvent_1
	ParallelGateway_4 --> Service_8["Notify customer"]
	Service_8 --> Service_7
	ExclusiveGateway_1 -->|"Burger only"| User_2
	ExclusiveGateway_6 -->|"No"| ExclusiveGateway_5
	ExclusiveGateway_6 -->|"Yes"| ParallelGateway_4
	ParallelGateway_3 --> Service_4
	User_6["Make payment"] --> User_7["Enter customer's\nname"]
	User_7 --> ParallelGateway_3
	ExclusiveGateway_4 --> User_6
