pmo-dataset/variations/graphviz_with_ids/44.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "User_1" [label="Select type of order"];
  "User_2" [label="Select burger"];
  "User_3" [label="Select type of\nbeverage"];
  "User_4" [label="Select side"];
  "User_5" [label="Select menu"];
  "User_6" [label="Make payment"];
  "User_7" [label="Enter customer's\nname"];
  "Service_1" [label="Prepare beverage"];
  "Service_2" [label="Prepare potato\nwedges"];
  "Service_3" [label="Prepare French fries"];
  "Service_4" [label="Prepare burger"];
  "Service_5" [label="Check status"];
  "Service_6" [label="Update status"];
  "Service_7" [label="Deliver via conveyor\nbelt"];
  "Service_8" [label="Notify customer"];
  "StartNoneEvent_1" [shape=circle, label="Food order decided"];
  "EndNoneEvent_1" [shape=circle, penwidth=4, label="Food delivered"];
  "IntermediateTimerEvent_1" [shape=doublecircle, label="30 seconds"];
  "ExclusiveGateway_1" [shape=diamond, label="Menu or just the\nburger ?"];
  "ExclusiveGateway_2" [shape=diamond, label="Fries or wedges ?"];
  "ExclusiveGateway_3" [shape=diamond, label="X"];
  "ExclusiveGateway_4" [shape=diamond, label="X"];
  "ExclusiveGateway_5" [shape=diamond, label="X"];
  "ExclusiveGateway_6" [shape=diamond, label="Is burger ready ?"];
  "ParallelGateway_1" [shape=diamond, label="+"];
  "ParallelGateway_2" [shape=diamond, label="+"];
  "ParallelGateway_3" [shape=diamond, label="+"];
  "ParallelGateway_4" [shape=diamond, label="+"];

  "StartNoneEvent_1" -> "User_1";
  "User_1" -> "ExclusiveGateway_1";
  "User_3" -> "ParallelGateway_1";
  "ParallelGateway_1" -> "Service_1";
  "ParallelGateway_1" -> "User_4";
  "Service_1" -> "ParallelGateway_2";
  "User_4" -> "ParallelGateway_2";
  "Service_2" -> "ExclusiveGateway_3";
  "Service_3" -> "ExclusiveGateway_3";
  "ExclusiveGateway_2" -> "Service_2" [label="Potato wedges"];
  "ExclusiveGateway_2" -> "Service_3" [label="French fries"];
  "ParallelGateway_2" -> "ExclusiveGateway_2";
  "User_5" -> "User_3";
  "User_2" -> "ExclusiveGateway_4";
  "ExclusiveGateway_1" -> "User_5" [label="With menu"];
  "ExclusiveGateway_3" -> "ExclusiveGateway_4";
  "ParallelGateway_3" -> "ExclusiveGateway_5";
  "IntermediateTimerEvent_1" -> "Service_5";
  "Service_5" -> "ExclusiveGateway_6";
  "Service_4" -> "ParallelGateway_4";
  "Service_7" -> "EndNoneEvent_1";
  "ExclusiveGateway_5" -> "Service_6";
  "Service_6" -> "IntermediateTimerEvent_1";
  "ParallelGateway_4" -> "Service_8";
  "Service_8" -> "Service_7";
  "ExclusiveGateway_1" -> "User_2" [label="Burger only"];
  "ExclusiveGateway_6" -> "ExclusiveGateway_5" [label="No"];
  "ExclusiveGateway_6" -> "ParallelGateway_4" [label="Yes"];
  "ParallelGateway_3" -> "Service_4";
  "User_6" -> "User_7";
  "User_7" -> "ParallelGateway_3";
  "ExclusiveGateway_4" -> "User_6";
}
